In [22]:
import sqlite3
import pandas as pd

con = sqlite3.connect("db")

student = pd.read_sql("SELECT * FROM Student", con, index_col=None)
student["phone_number"] = student["phone_number"].astype(str)


student.to_csv('student.csv', index=False)

In [3]:
score = pd.read_sql("SELECT * FROM Score", con, index_col=None)
score

    name  score
0  louis     90
1  alice     95
2    bob     80

In [6]:
pd.merge(student, score, left_on="Name", right_on="name", how="left")

    Name  grade phone_number   name  score
0  louis      3  01042740974  louis   90.0
1  alice      4  01012345678  alice   95.0
2    bob      4  01012345678    bob   80.0
3  nancy      2  01012345678    NaN    NaN

In [8]:
pd.merge(score, student, left_on="name", right_on="Name", how="inner")

    name  score   Name  grade phone_number
0  louis     90  louis      3  01042740974
1  alice     95  alice      4  01012345678
2    bob     80    bob      4  01012345678

In [11]:
chipo = pd.read_csv("chipolet.tsv", sep = '\t')
chipo["item_price"] = chipo["item_price"].apply(lambda x: float(x[1:]))

In [19]:
chipo.drop('choice_description',axis=1).to_sql('item_order', con, index=False, if_exists='replace')

4622

In [ ]:
()